# DebugLevelsInOptionsError Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DesignOptionFailures..::..DebugLevelsInOptionsError Property
BuiltInFailures..::..DesignOptionFailures Class See Also
---
This is an internal diagnostic message.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DebugLevelsInOptionsError { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DebugLevelsInOptionsError As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DebugLevelsInOptionsError {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DesignOptionFailures Class
Autodesk.Revit.DB Namespace